import pandas as pd
import pytest


@pytest.fixture
def tests_data_for_readers():
    return {"Столбец1": ["Один", "Два", "Три"]}


@pytest.fixture
def tests_data_for_readers_not_json():
    return {"Столбец1": ["Один", "Два", 'Три']}


@pytest.fixture
def get_date_string():
    return "20.03.2025"


# @pytest.fixture
# def transactions_for_sorted():
#     return {
#     "Дата операции": [
#         "01.01.2025 10:00:00", "15.01.2025 14:30:00", "01.02.2025 09:15:00",
#         "15.02.2025 18:45:00", "01.03.2025 12:00:00", "10.01.2025 16:20:00",
#         "20.01.2025 11:10:00", "05.02.2025 17:30:00", "25.02.2025 13:40:00",
#         "28.02.2025 19:55:00"
#     ],


@pytest.fixture
def transactions():
    return pd.DataFrame({
        "Дата операции": [
            "01.01.2025 10:00:00", "05.01.2025 12:15:00", "09.01.2025 09:45:00", "13.01.2025 16:20:00",
            "17.01.2025 14:30:00", "21.01.2025 11:10:00", "25.01.2025 18:00:00", "29.01.2025 13:25:00",
            "02.02.2025 10:50:00", "06.02.2025 09:15:00", "10.02.2025 17:40:00", "14.02.2025 14:55:00",
            "18.02.2025 12:30:00", "22.02.2025 19:05:00", "26.02.2025 18:45:00", "01.03.2025 10:20:00",
            "01.03.2025 15:10:00", "01.03.2025 08:45:00", "01.03.2025 20:00:00", "01.03.2025 12:00:00"
        ],
        "Статус": [
            "OK", "OK", "FAILED", "OK", "OK", "OK", "OK", "OK", "OK", "FAILED",
            "OK", "OK", "FAILED", "OK", "OK", "OK", "OK", "OK", "OK", "FAILED"
        ],
        "Сумма операции": [
            -1162.00, -2500.00, -736.00, -1200.00, 500.00, -300.00, -1794.00, -1350.00, -923.00, -450.00,
            -1264.00, 800.00, -2815.00, -13730.00, -358.00, -450.00, -566.45, -250.00, -1469.00, -600.00
        ],
        "Категория": [
            "Супермаркеты", "АЗС", "Рестораны", "Наличные", "Пополнения", "Переводы", "Аптеки", "Кафе",
            "Супермаркеты", "Кино", "Переводы", "Наличные", "Рестораны", "Одежда", "Транспорт",
            "Развлечения", "Аптеки", "Кафе", "Супермаркеты", "Кино"
        ],
        "Описание": [
            "Магнит", "Лукойл", "Ресторан 'Вкусно'", "Снятие наличных", "Перевод на карту", "Кинотеатр", "Аптека 'Здоровье'",
            "Кафе 'Кофе'", "Пятерочка", "Кинотеатр", "Перевод другу", "Внесение наличных", "Ресторан 'Уют'",
            "Магазин 'Мода'", "Метро", "Театр", "Аптека 'Витамины'", "Кафе 'Чай'", "Магнит", "Кинотеатр"
        ],
        "Сумма операции с округлением": [
            1162.00, 2500.00, 736.00, 1200.00, 500.00, 300.00, 1794.00, 1350.00, 923.00, 450.00,
            1264.00, 800.00, 2815.00, 13730.00, 358.00, 450.00, 566.45, 250.00, 1469.00, 600.00
        ]
    })


@pytest.fixture
def user_currencies_test():
    return ["USD", "EUR"]


@pytest.fixture
def user_stocks_test():
    return ["AAPL", "AMZN"]


@pytest.fixture
def weekends_list():
    return [
        "Понедельник",
        "Вторник",
        "Среда",
        "Четверг",
        "Пятница",
        "Суббота",
        "Воскресенье"
    ]
